CentrifugalCompressor/OpenFoam-2.3.0/case-1-g/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            flowRateInletVelocity;
        value           uniform (0 0 0); //flowRate is 0.42kg/s
        rho		rho;
        phi		phi;
        massFlowRate	constant 0.42;
    }
    
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    
    rotor
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    
    stator
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    #include		"ami.include";
}


// ************************************************************************* //
