CentrifugalCompressor/OpenFoam-2.3.0/case-1-g/0/ami.include
ami_1
{
    type	cyclicAMI;
    value	$internalField;
}

ami_2
{
    type	cyclicAMI;
    value	$internalField;
}

ami_3
{
    type	cyclicAMI;
    value	$internalField;
}

ami_4
{
    type	cyclicAMI;
    value	$internalField;
}
