CentrifugalCompressor/OpenFoam-2.3.0/case-1-g/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 24;

method          scotch;

simpleCoeffs
{
    n               (1 1 4);
    delta           0.001;
}

manualCoeffs
{
    dataFile "cellsToProcessors";
}

distributed     no;

roots
(
);

// ************************************************************************* //
